
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        5 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                   |
|:--------:|:----------------------------------------------------------------------------|
|    🟢    | `module.ci_cd_params_338531211565.aws_ssm_parameter.admin_role_arn`         |
|    🟢    | `module.ci_cd_params_338531211565.aws_ssm_parameter.github_role_arn`        |
|    🟢    | `module.ci_cd_params_338531211565.aws_ssm_parameter.lock_table`             |
|    🟢    | `module.ci_cd_params_338531211565.aws_ssm_parameter.state_bucket`           |
|    🟢    | `module.ci_cd_params_338531211565.aws_ssm_parameter.state_manager_role_arn` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ci_cd_params_338531211565.aws_ssm_parameter.admin_role_arn will be created
  + resource "aws_ssm_parameter" "admin_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/aws-control-338531211565/ci-cd/admin_role_arn"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.ci_cd_params_338531211565.aws_ssm_parameter.github_role_arn will be created
  + resource "aws_ssm_parameter" "github_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/aws-control-338531211565/ci-cd/github_role_arn"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.ci_cd_params_338531211565.aws_ssm_parameter.lock_table will be created
  + resource "aws_ssm_parameter" "lock_table" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/aws-control-338531211565/backend/lock_table"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.ci_cd_params_338531211565.aws_ssm_parameter.state_bucket will be created
  + resource "aws_ssm_parameter" "state_bucket" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/aws-control-338531211565/backend/state_bucket"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.ci_cd_params_338531211565.aws_ssm_parameter.state_manager_role_arn will be created
  + resource "aws_ssm_parameter" "state_manager_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/aws-control-338531211565/backend/state_manager_role_arn"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on aws_iam_role.ih_tf_aws_control_338531211565.tf line 44, in module "ci_cd_params_338531211565":
  44:     aws = aws.aws-338531211565-uw1

There is no explicit declaration for local provider name "aws" in
module.ci_cd_params_338531211565, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDUsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>